app/Models/BBModel.php

SELECT *
FROM `tbl_login`
WHERE `username` = 'admin'
---
    public function getAdminByUsername($username)
    {
        return $this->db->table($this->table_login) // Menggunakan $this->db->table() untuk tabel lain
                         ->where('username', $username)
                         ->get()
                         ->getRowArray();

SELECT *
FROM `tbl_barang`
ORDER BY `id_barang` DESC
---
    public function getAllBarang()
    {
        return $this->orderBy('id_barang', 'DESC')->findAll();

SELECT *
FROM `tbl_barang`
ORDER BY `id_barang` DESC
---
    public function getAllDataAdmin()
    {
        return $this->orderBy('id_barang', 'DESC')->findAll();